app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `password_digest`, `created_at`, `updated_at`, `email`) VALUES ('priya', '$2a$12$Bw2bHCqVug5c/YLLB87kxudDN1kN47c/BYIwVXRykMriuxnVLTT3i', '2023-03-29 17:59:16.927493', '2023-03-29 17:59:16.927493', 'pdalalwhelan@smith.edu')
---
    def create
      @user = User.create(params.require(:user).permit(:username, :password, :email))